{"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10, 5, 6, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 5, 6, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d", "trainable": true, "batch_input_shape": [null, 10, 5, 6, 1], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 32, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_3", "trainable": true, "batch_input_shape": [null, 10, 5, 6, 1], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 32, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_3", "inbound_nodes": [[["input_2", 0, 0, {}], ["conv_lst_m2d", 0, 1, {}], ["conv_lst_m2d", 0, 2, {}]], [["lambda", 0, 0, {}], ["conv_lst_m2d_3", 0, 1, {}], ["conv_lst_m2d_3", 0, 2, {}]], [["lambda", 1, 0, {}], ["conv_lst_m2d_3", 1, 1, {}], ["conv_lst_m2d_3", 1, 2, {}]], [["lambda", 2, 0, {}], ["conv_lst_m2d_3", 2, 1, {}], ["conv_lst_m2d_3", 2, 2, {}]], [["lambda", 3, 0, {}], ["conv_lst_m2d_3", 3, 1, {}], ["conv_lst_m2d_3", 3, 2, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_1", "trainable": true, "batch_input_shape": [null, 10, 5, 6, 32], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_1", "inbound_nodes": [[["conv_lst_m2d", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_4", "trainable": true, "batch_input_shape": [null, 10, 5, 6, 32], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 16, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_4", "inbound_nodes": [[["conv_lst_m2d_3", 0, 0, {}], ["conv_lst_m2d_1", 0, 1, {}], ["conv_lst_m2d_1", 0, 2, {}]], [["conv_lst_m2d_3", 1, 0, {}], ["conv_lst_m2d_4", 0, 1, {}], ["conv_lst_m2d_4", 0, 2, {}]], [["conv_lst_m2d_3", 2, 0, {}], ["conv_lst_m2d_4", 1, 1, {}], ["conv_lst_m2d_4", 1, 2, {}]], [["conv_lst_m2d_3", 3, 0, {}], ["conv_lst_m2d_4", 2, 1, {}], ["conv_lst_m2d_4", 2, 2, {}]], [["conv_lst_m2d_3", 4, 0, {}], ["conv_lst_m2d_4", 3, 1, {}], ["conv_lst_m2d_4", 3, 2, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_2", "trainable": true, "batch_input_shape": [null, 10, 5, 6, 16], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 8, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_2", "inbound_nodes": [[["conv_lst_m2d_1", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "conv_lst_m2d_5", "trainable": true, "batch_input_shape": [null, 10, 5, 6, 16], "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 8, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0}, "name": "conv_lst_m2d_5", "inbound_nodes": [[["conv_lst_m2d_4", 0, 0, {}], ["conv_lst_m2d_2", 0, 1, {}], ["conv_lst_m2d_2", 0, 2, {}]], [["conv_lst_m2d_4", 1, 0, {}], ["conv_lst_m2d_5", 0, 1, {}], ["conv_lst_m2d_5", 0, 2, {}]], [["conv_lst_m2d_4", 2, 0, {}], ["conv_lst_m2d_5", 1, 1, {}], ["conv_lst_m2d_5", 1, 2, {}]], [["conv_lst_m2d_4", 3, 0, {}], ["conv_lst_m2d_5", 2, 1, {}], ["conv_lst_m2d_5", 2, 2, {}]], [["conv_lst_m2d_4", 4, 0, {}], ["conv_lst_m2d_5", 3, 1, {}], ["conv_lst_m2d_5", 3, 2, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["conv_lst_m2d_3", 0, 0, {}], ["conv_lst_m2d_4", 0, 0, {}], ["conv_lst_m2d_5", 0, 0, {}]], [["conv_lst_m2d_3", 1, 0, {}], ["conv_lst_m2d_4", 1, 0, {}], ["conv_lst_m2d_5", 1, 0, {}]], [["conv_lst_m2d_3", 2, 0, {}], ["conv_lst_m2d_4", 2, 0, {}], ["conv_lst_m2d_5", 2, 0, {}]], [["conv_lst_m2d_3", 3, 0, {}], ["conv_lst_m2d_4", 3, 0, {}], ["conv_lst_m2d_5", 3, 0, {}]], [["conv_lst_m2d_3", 4, 0, {}], ["conv_lst_m2d_4", 4, 0, {}], ["conv_lst_m2d_5", 4, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAcyIAAAB8AGQAZACFAmQBZABkAIUCZABkAIUCZABkAIUCZgUZ\nAFMAKQJO6QAAAACpACkB2gF4cgIAAAByAgAAAPoSY29udkxTVE1fdGFyZ2V0LnB52gg8bGFtYmRh\nPh4AAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["concatenate", 0, 0, {}]], [["concatenate", 1, 0, {}]], [["concatenate", 2, 0, {}]], [["concatenate", 3, 0, {}]], [["concatenate", 4, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_1", 1, 0, {}]], [["lambda_1", 2, 0, {}]], [["lambda_1", 3, 0, {}]], [["lambda_1", 4, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["conv2d", 0, 0, {}]], [["conv2d", 1, 0, {}]], [["conv2d", 2, 0, {}]], [["conv2d", 3, 0, {}]], [["conv2d", 4, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]], [["conv2d_1", 1, 0, {}]], [["conv2d_1", 2, 0, {}]], [["conv2d_1", 3, 0, {}]], [["conv2d_1", 4, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABDAAAAcxIAAAB8AHQAagF8AGQBZAKNAhsAUwApA06pA+kBAAAA6QIA\nAADpAwAAACkB2gRheGlzKQLaAUvaA3N1bSkB2gF4qQByCQAAAPoSY29udkxTVE1fdGFyZ2V0LnB5\n2gg8bGFtYmRhPiMAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]], [["conv2d_2", 1, 0, {}]], [["conv2d_2", 2, 0, {}]], [["conv2d_2", 3, 0, {}]], [["conv2d_2", 4, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcwwAAAB0AKABfABkAaECUwApAk7pAQAAACkC2gFL2gtleHBh\nbmRfZGltcykB2gF4qQByBQAAAPoSY29udkxTVE1fdGFyZ2V0LnB52gg8bGFtYmRhPhsAAADzAAAA\nAA==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["lambda_2", 0, 0, {}]], [["lambda_2", 1, 0, {}]], [["lambda_2", 2, 0, {}]], [["lambda_2", 3, 0, {}]], [["lambda_2", 4, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcw4AAAB0AGoBfABkAWQCjQJTACkDTukBAAAAKQHaBGF4aXMp\nAtoBS9oLY29uY2F0ZW5hdGUpAdoBeKkAcgYAAAD6EmNvbnZMU1RNX3RhcmdldC5wedoIPGxhbWJk\nYT68AAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_3", "inbound_nodes": [[["lambda", 0, 0, {}], ["lambda", 1, 0, {}], ["lambda", 2, 0, {}], ["lambda", 3, 0, {}], ["lambda", 4, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "batch_input_shape": [null, 5, 5, 6, 1], "dtype": "float32", "target_shape": [5, 30]}, "name": "reshape", "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["reshape", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}